import libraries

In [11]:
import pandas as pd, numpy as np

In [23]:
cust_sales = pd.DataFrame(
    {'Customer': ['Jones Brothers', 'Beta Corp', 'Globex Corp', 'Acme', 'Initech', 'Hooli'],
     'Sales': [500, '£1,000.00', 300.1, '£750.01', 300, 250]
    },
    index = [0, 1, 2, 3, 4, 5]
)
cust_sales

         Customer      Sales
0  Jones Brothers        500
1       Beta Corp  £1,000.00
2     Globex Corp      300.1
3            Acme    £750.01
4         Initech        300
5           Hooli        250

In [24]:
cust_sales.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Customer  6 non-null      object
 1   Sales     6 non-null      object
dtypes: object(2)
memory usage: 144.0+ bytes

show each sales dtype

In [25]:
cust_sales['Sales_Type'] = cust_sales['Sales'].apply(lambda x: type(x).__name__)
cust_sales

         Customer      Sales Sales_Type
0  Jones Brothers        500        int
1       Beta Corp  £1,000.00        str
2     Globex Corp      300.1      float
3            Acme    £750.01        str
4         Initech        300        int
5           Hooli        250        int

or more compact way

In [26]:
cust_sales['Sales'].apply(type).value_counts()

Sales
<class 'int'>      3
<class 'str'>      2
<class 'float'>    1
Name: count, dtype: int64

get an error trying to use string functions on an integer

In [27]:
#cust_sales['Sales'].apply(lambda x: x.replace('£', '').replace(',', '')).astype('float')

to go around it, write a normal function

In [38]:
currency_list = ['£', '€', '$']
def clean_currency(value):
    """ If the value is a string, then remove currency symbol and delimiters
    otherwise, the value is numeric and can be converted
    """
    if isinstance(value, str):
        for x in value:
            if x in currency_list:
                return(value.replace(',', '').replace('£', '').replace('$', '').replace('€', ''))
    return(value)

alternatively, can use this lambda function

In [39]:
cust_sales['Sales'] = cust_sales['Sales'].apply(lambda x: x.replace('$', '').replace(',', '')
                                if isinstance(x, str) else x).astype(float)

apply the function to convert string to float

In [40]:
cust_sales['Sales'] = cust_sales['Sales'].apply(clean_currency).astype('float')
cust_sales['Sales_Type'] = cust_sales['Sales'].apply(lambda x: type(x).__name__) #convert the dtypes

In [41]:
cust_sales

         Customer    Sales Sales_Type
0  Jones Brothers   500.00      float
1       Beta Corp  1000.00      float
2     Globex Corp   300.10      float
3            Acme   750.01      float
4         Initech   300.00      float
5           Hooli   250.00      float